package char

// https://tw.piliapp.com/symbol/subscript-superscript/

// subScript
// ₀₁₂₃₄₅₆₇₈₉₊₋₌₍₎ₐₑₒₓₔₐₑₕᵢⱼₖₗₘₙₒₚᵣₛₜᵤᵥₓᵦᵧᵨᵩᵪ
var (
	subScript = map[string]string{
		"0":     "₀",
		"1":     "₁",
		"2":     "₂",
		"3":     "₃",
		"4":     "₄",
		"5":     "₅",
		"6":     "₆",
		"7":     "₇",
		"8":     "₈",
		"9":     "₉",
		"+":     "₊",
		"-":     "₋",
		"=":     "₌",
		"(":     "₍",
		")":     "₎",
		"a":     "ₐ",
		"e":     "ₑ",
		"h":     "ₕ",
		"i":     "ᵢ",
		"j":     "ⱼ",
		"k":     "ₖ",
		"l":     "ₗ",
		"m":     "ₘ",
		"n":     "ₙ",
		"o":     "ₒ",
		"x":     "ₓ",
		"ə":     "ₔ",
		"A":     "ₐ",
		"E":     "ₑ",
		"H":     "ₕ",
		"I":     "ᵢ",
		"J":     "ⱼ",
		"K":     "ₖ",
		"L":     "ₗ",
		"M":     "ₘ",
		"N":     "ₙ",
		"O":     "ₒ",
		"X":     "ₓ",
		"Beta":  "ᵦ",
		"Gamma": "ᵧ",
		"Rho":   "ᵨ",
		"Phi":   "ᵩ",
		"Chi":   "ᵪ",
	}
)
